{
  "views": {
    "error404": "Error 404",
    "home": "Inicio",
    "inDevelopment": "En desarrollo"
  },
  "navbar": {
    "about": "Acerca",
    "resume": "CV",
    "contact": "Contacto",
    "language": "Lenguaje",
    "linkedin": "LinkedIn",
    "github": "Github"
  },
  "resume": {
    "href": "/docs/resume.public.es.pdf"
  },
  "buttons": {
    "close": "Cerrar",
    "expand": "Expandir"
  },
  "dev": {
    "inDevelopment": "Sitio web en construcción"
  },
  "home": {
    "welcome": "¡Hola!"
  },
  "about": {
    "title": "Acerca de mí",
    "description": "Mi nombre es Alexander, tengo 26 años y soy de Santiago, Chile.",
    "currently": "Ingeniero en Informática, geek, aficionado de los videojuegos, del aprendizaje autónomo y el diseño gráfico. Como hobby, he creado y modificado recursos de FiveM para un servidor de Roleplay, el cual he sido el desarrollador principal desde marzo del 2019, trabajando en Lua, HTML, Javascript, CSS, C# y bases de datos MySQL. A lo largo de estos años he sido partícipe en distintas comunidades de servidores de videojuegos, como moderador, administrador y/o programador, tales como GTA:SAMP (Pawno Scripting), Minecraft (Java) y Rust Oxidemod (C#); en conjunto a esto, he trabajado con bases de datos MySQL, SQLite, H2, etc. y administrado servidores con el sistema operativo Linux, el cual la mayoría de estos servidores usan.",
    "status": "Actualmente estoy trabajando como <b>Ingeniero de Datos</b> en <a href=\"https://www.linkedin.com/company/cencosud-scotiabank/\">Cencosud Scotiabank (CAT)</a>."
  },
  "skills": {
    "title": "Habilidades",
    "skill": "Habilidad",
    "level": "Nivel",
    "programming": "Programación",
    "frameworks": "Web frameworks",
    "misc": "Misceláneo",
    "other": "Otras"
  },
  "work": {
    "title": "Experiencia Laboral",
    "cat": {
      "title": "Cencosud Scotiabank (CAT)",
      "subtitle": "Ingeniero de Datos & Desarrollador de Microservicios",
      "description": "<i>Cencosud Administradora de Tarjetas.</i> Ingresé como desarrollador semi-senior de microservicios, luego tomé el desafío y oportunidad de trabajar como ingeniero de datos con enfoque en Azure.",
      "others": [
        "Ingeniería de datos: ETLs, Azure Databricks, Apache Spark SQL (PySpark), Python, Azure Data Factory",
        "Desarrollo de microservicios: Java Spring Boot, arquitectura hexagonal, tests unitarios, API REST y SOAP, Kafka, Kubernetes, Docker, Rancher, Scrum, Jira, Confluence y Bitbucket"
      ],
      "date": "diciembre 2022 - actualidad"
    },
    "acl": {
      "title": "ACL",
      "subtitle": "Desarrollador externo",
      "description": "<i>Servicios y consultoría de TI.</i> Parte del Programa Profesionales Jóvenes realizando mi segunda práctica profesional y posterior trabajador externo proveyendo servicios a Cencosud Administradora de Tarjetas (CAT).",
      "others": [
        "Stack: MongoDB, Express.js, React, Node.js (MERN) y Java Spring Boot",
        "Desarrollo de habilidades blandas, manejo de conflictos y competencias laborales",
        "Presentaciones semanales a equipo de trabajo sobre proyectos y aprendizaje de herramientas y contenidos de desarrollo de software"
      ],
      "date": "abril 2023 - actualidad"
    },
    "ecmat": {
      "title": "eCmat",
      "subtitle": "Frontend Developer",
      "description": "<i>Ciencia de datos aplicada a la cadena de suministro de la construcción.</i> He trabajado para eCmat como desarrollador frontend, realizando mejoras en su página privada y web scraping.",
      "others": [
        "Desarrollo frontend:<br />· Entorno de desarrollo: Angular + Django<br />· Base de datos NoSQL: MongoDB",
        "Web scraping:<br />· Entorno de desarrollo: Selenium Python + Scrapy"
      ],
      "date": "octubre 2021 - febrero 2022"
    },
    "nutrialus": {
      "title": "Nutrialus",
      "subtitle": "Desarrollador de Software Full-Stack",
      "description": "<i>Nutrialus, el software que automatiza la evaluación nutricional de tus pacientes y te ayuda a elaborar fácilmente un plan de alimentación personalizado.</i> Ingresé a Nutrialus por 3 meses realizando mi práctica profesional, realizando una labor de Desarrollador de Software Full-Stack, después de la práctica profesional, fui contratado para realizar la misma labor, en modalidad part-time.",
      "others": [
        "Desarrollo de aplicación web para profesionales nutricionistas:<br />· Entorno de desarrollo: Ruby on Rails + React<br />· Base de datos relacional: PostgreSQL<br />· Motores/Bases de datos: Elasticsearch, Redis",
        "Aplicación móvil para pacientes y profesionales nutricionistas:<br />· Entorno de desarrollo: React Native"
      ],
      "date": "abril 2021 - septiembre 2022"
    },
    "hispano": {
      "title": "Comunidad Hispano",
      "subtitle": "Desarrollador - Co-Fundador (Como hobby)",
      "description": "<i>Comunidad de juegos iniciada en latinoamérica, fundada en marzo del 2019, con más de 1000 jugadores activos al mes.</i> Formé parte de la fundación de la comunidad, de la cual he sido partícipe de manera activa en su desarrollo y crecimiento desde entonces. Todo esto lo he realizado como hobby.",
      "others": [
        "Desarrollo de servidor de FiveM Roleplay:<br />· Entorno de desarrollo: Lua, JavaScript, C#, HTML, CSS, Vue.js<br />· Bases de datos relacional: MySQL"
      ],
      "date": "marzo 2019 - actualidad"
    }
  },
  "portfolio": {
    "title": "Portafolio",
    "nutrial_mobile": {
      "title": "Aplicación móvil de Nutrialus",
      "description": "He estado desarrollando la aplicación móvil Nutrialus en React Native desde mi práctica profesional con ellos, actualmente muestra datos para el paciente, el plan de comidas, gráficos y un menú de configuración, lo que permite un cambio de contraseña, cerrar sesión y cambiar entre tema claro y oscuro. Luego, la aplicación se actualizó para mostrar un índice de pacientes para los nutricionistas, lo que les permite ver cómo su paciente ve la aplicación.",
      "caption_patient_home": "Inicio del Paciente",
      "text_patient_home": "La vista de inicio del paciente muestra la fecha actual, la próxima comida, con un componente de actualización que muestra la comida con el tiempo restante. Las siguientes dos ventanas muestran la energía y los macronutrientes, finalmente su nutricionista.",
      "caption_patient_meals": "Comidas del Paciente",
      "text_patient_meals": "La vista de comidas del paciente muestra los días de la semana y la planificación de las comidas del paciente, muestra cada alimento, los gramos y las alternativas para cada alimento en caso de que tenga uno.",
      "caption_patient_charts": "Gráficos del Paciente",
      "text_patient_charts": "La vista de gráficos del paciente muestra diferentes gráficos de su progreso con el nutricionista actual, algunos de estos gráficos son Peso, IMC, Mediciones y otros.",
      "caption_menu": "Menú de Configuración",
      "text_menu": "El menú de configuración está dividido en configuración de Cuenta y Aplicación, por el momento, permite al usuario cambiar la contraseña, cerrar la sesión y cambiar el tema.",
      "caption_change_password": "Cambiar Contraseña",
      "text_change_password": "Diálogo simple para cambiar la contraseña.",
      "caption_change_theme": "Cambiar Tema",
      "text_change_theme": "Switch simple para cambiar el tema de la aplicación.",
      "caption_nutritionist_home": "Inicio del Nutricionista",
      "text_nutritionist_home": "La vista de inicio del nutricionista muestra la fecha actual, el plan actual y el perfil del nutricionista.",
      "caption_nutritionist_patients": "Pacientes del Nutricionista",
      "text_nutritionist_patients": "La vista de pacientes del nutricionista muestra todos los pacientes del nutricionista, mostrando la información más importante y permitiéndoles ver la aplicación como ese paciente.",
      "caption_nutritionist_patient": "Paciente del Nutricionista",
      "text_nutritionist_patient": "La vista de paciente del nutricionista muestra las mismas vistas que una sesión iniciada como paciente, pero dentro de la vista del índice de pacientes del nutricionista."
    },
    "catalog": {
      "title": "Catálogo vehicular",
      "description": "Este es un catálogo que hice para el servidor Roleplay (backend en Lua), obtiene todos los vehículos disponibles y sus datos de una base de datos MySQL, además, recopilé datos de GTABase para mostrar información adicional.",
      "caption1": "Pestaña principal",
      "text1": "Muestra todas las categorías y sus vehículos, junto con algunos detalles importantes que pueden interesar al jugador, cada vehículo tiene una imagen y un botón para ver los detalles. La lista de vehículos se puede ordenar por nombre, precio o stock.",
      "caption2": "Modal del vehículo",
      "text2": "El modal muestra la información detallada del vehículo.",
      "caption3": "Modal del vehículo (cont.)",
      "text3": "El modal muestra la información detallada del vehículo."
    },
    "shop": {
      "title": "Tienda",
      "description": "Esta es una tienda que hice para el servidor de Roleplay (backend en Lua), cada tienda tiene artículos específicos y son administrados por el usuario. Cada artículo disponible se puede agregar al carrito, este se actualiza automáticamente y muestra los detalles en una tabla al usuario, no permite al usuario agregar más que el stock disponible, y para ciertos artículos únicos, no permite agregar más de uno.",
      "caption1": "Pestaña de tienda",
      "text1": "Muestra el nombre de la tienda, todos los artículos disponibles, su precio y stock, cada artículo se puede agregar o eliminar desde este menú.",
      "caption2": "Pestaña de tienda",
      "text2": "Muestra el nombre de la tienda, todos los artículos disponibles, su precio y stock, cada artículo se puede agregar o eliminar desde este menú.",
      "caption3": "Pestaña del carrito",
      "text3": "Muestra todos los artículos agregados, el precio unitario, el stock, la cantidad a comprar (modificable), el precio final y un botón para eliminar el artículo. Al final de la tabla, muestra el precio final y dos botones en la parte inferior, vaciar carrito y comprar."
    },
    "pass": {
      "title": "Pase Premium",
      "description": "Para beneficiar a algunos de nuestros donadores y jugadores simultáneos, hice un sistema de \"pase de batalla\" (backend en Lua), los datos de cada elemento se almacenan en un archivo configurable y los datos del jugador se almacenan en una tabla en una base de datos MySQL , almacenando la recompensa del último jugador y su tiempo de enfriamiento. Además, tiene una pestaña de información que muestra todas las recompensas para nuestros donadores.",
      "caption1": "Pestaña principal",
      "text1": "Muestra todas las recompensas, con un botón para reclamadas, reclamables y no disponibles. Se puede desplazar hasta el nivel final.",
      "caption2": "Pestaña de información",
      "text2": "Muestra todas las recompensas para nuestros seguidores."
    },
    "images_large": {
      "title": "Carteles publicitarios",
      "description": "En mi tiempo libre, hice algunos carteles publicitarios para algunos miembros de mi familia, nada demasiado elegante ni profesional."
    },
    "images_wide": {
      "title": "Fondos de pantalla",
      "description": "Para algunos de mis proyectos personales, he creado fondos para transmisiones o videos."
    },
    "animation": {
      "title": "Animaciones",
      "description": "También para proyectos personales, hice algunas animaciones en Adobe After Effects, las he usado en transmisiones y videos que he creado.",
      "caption1": "Notificación de Twitch",
      "text1": "Animación simple para una notificación de Twitch, utilizada para suscripciones, seguimientos y otros."
    },
    "rdr2review": {
      "title": "Red Dead Redemption 2 Review",
      "description": "Siempre me han gustado las reviews/reseñas de juegos y quería experimentar con la creación de una, jugué, capturé imágenes del juego, creé, edité, escribí y le di voz al video. Para este tipo de proyectos, utilizo Adobe Premiere Pro, After Effects, Photoshop, Illustrator y Audacity."
    },
    "cp2077hypeometro": {
      "title": "Hype-ómetro: Cyberpunk 2077",
      "description": "Al igual que las reviews, me encantan las discusiones de juegos, así que, con un par de amigos discutimos uno de los juegos más destacados lanzados en 2020, antes de que saliera, creé y edité el video, la discusión es bastante genérica, pero genuina. Se supone que el nombre Hype-ómetro significa la cantidad de hype creada por el juego y la discusión que tuvimos al respecto."
    },
    "daysgonehypeometro": {
      "title": "Hype-ómetro: Days Gone",
      "description": "Lo mismo que el Hype-ómetro de Cyberpunk 2077, pero sobre Days Gone."
    },
    "cp2077instagram": {
      "title": "Publicidad de Instagram",
      "description": "Para los videos anteriores, hice algunas animaciones para Instagram."
    },
    "admin_menu": {
      "title": "Menú de Administración",
      "description": "Este menú está desarrollado para Hispano Roleplay, permite a los jugadores administrar los miembros y activos de su facción, mostrando detalles sobre cada sección. Está desarrollado en React con Chakra UI y Lua backend. "
    }
  }
}
